src/InformationRegisters/onyx_ЖурналРаботыСAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>onyx_ЖурналРаботыСAPI</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_ТипЗапроса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_ТипОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/onyx_ТипЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_ТипЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСпискаАгентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/onyx_ТипОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_ТипОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеТокена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСпискаАгентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/onyx_ОбработкаОшибок/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Проверяет результат HTTP-запроса и обрабатывает ошибки.
//
// Параметры:
//   Ответ - Структура - результат, возвращенный модулем onyx_ПодключениеКAPI.
//   Настройки - Структура - пользовательские настройки API (необязательный).
//   ТипЗапроса - ПеречислениеСсылка.onyx_ТипЗапроса - тип выполняемого запроса (необязательный).
//   ТипОперации - ПеречислениеСсылка.onyx_ТипОперации - тип операции в журнале (необязательный).
//
// Возвращаемое значение:
//   Структура - исходный ответ при успешном выполнении.
//
// Исключения:
//   В случае ошибки API возбуждается исключение с детальным описанием.
Функция ПроверитьОтвет(Ответ, Настройки = Неопределено, ТипЗапроса = Неопределено, ТипОперации = Неопределено) Экспорт
	
	ИтоговыйТипЗапроса = ОпределитьТипЗапроса(Ответ, ТипЗапроса);
	ИтоговыйТипОперации = ОпределитьТипОперации(Ответ, ТипОперации);
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Ответ", Ответ);
	ПараметрыЗаписи.Вставить("ТипЗапроса", ИтоговыйТипЗапроса);
	ПараметрыЗаписи.Вставить("ТипОперации", ИтоговыйТипОперации);
	РегистрыСведений.onyx_ЖурналРаботыСAPI.ЗаписатьЗапись(ПараметрыЗаписи);
	
	Если Ответ.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	СообщениеОбОшибке = ПолучитьОписаниеОшибки(Ответ);
	СообщениеОбОшибке = ДополнитьСообщениеПоСтатусу(Ответ.СтатусКод, СообщениеОбОшибке);
	
	ВызватьИсключение СообщениеОбОшибке;
	
КонецФункции

// Формирует структуру для отображения пользователю.
//
// Параметры:
//   Успех - Булево - признак успешности операции.
//   Сообщение - Строка - текстовое описание результата.
//   Данные - Произвольный - дополнительные данные ответа (необязательный).
//
// Возвращаемое значение:
//   Структура - заполненный ответ для пользовательского интерфейса.
Функция СформироватьОтвет(Успех, Сообщение, Данные = Неопределено) Экспорт
	
	Возврат Новый Структура("Успех,Сообщение,Данные", Успех, Сообщение, Данные);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные функции

// Возвращает перечисление типа запроса по URL, если явное значение не передано.
//
// Параметры:
//   Ответ - Структура - данные HTTP-ответа.
//   ПереданныйТипЗапроса - ПеречислениеСсылка.onyx_ТипЗапроса - установленный ранее тип запроса.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.onyx_ТипЗапроса - итоговый тип запроса.
Функция ОпределитьТипЗапроса(Ответ, ПереданныйТипЗапроса) Экспорт
	
	Если ЗначениеЗаполнено(ПереданныйТипЗапроса) Тогда
		Возврат ПереданныйТипЗапроса;
	КонецЕсли;
	
	URL = НРег(Ответ.URL);
	
	Если СтрНайти(URL, "/persona/") > 0 Тогда
		Возврат Перечисления.onyx_ТипЗапроса.ПолучениеАгента;
	КонецЕсли;
	
	Если СтрНайти(URL, "/persona") > 0 Тогда
		Возврат Перечисления.onyx_ТипЗапроса.ПолучениеСпискаАгентов;
	КонецЕсли;
	
	Если СтрНайти(URL, "/chat/create-chat-session") > 0 Тогда
		Возврат Перечисления.onyx_ТипЗапроса.СозданиеСессии;
	КонецЕсли;
	
	Если СтрНайти(URL, "/chat/send-message") > 0 Тогда
		Возврат Перечисления.onyx_ТипЗапроса.ОтправкаСообщения;
	КонецЕсли;
	
	Если СтрНайти(URL, "/chat/get-chat-session") > 0 Тогда
		Возврат Перечисления.onyx_ТипЗапроса.ПолучениеСессии;
	КонецЕсли;
	
	Возврат Перечисления.onyx_ТипЗапроса.Другое;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

// Возвращает итоговый тип операции по URL и статусу.
//
// Параметры:
//   Ответ - Структура - данные HTTP-ответа.
//   ПереданныйТипОперации - ПеречислениеСсылка.onyx_ТипОперации - заранее определенный тип операции.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.onyx_ТипОперации - итоговый тип операции.
Функция ОпределитьТипОперации(Ответ, ПереданныйТипОперации)
	
	Если ЗначениеЗаполнено(ПереданныйТипОперации) Тогда
		Возврат ПереданныйТипОперации;
	КонецЕсли;
	
	URL = НРег(Ответ.URL);
	Статус = Ответ.СтатусКод;
	
	Если Статус >= HttpErrorCodeMin() Тогда
		Возврат Перечисления.onyx_ТипОперации.Ошибка;
	КонецЕсли;
	
	Если СтрНайти(URL, "/persona/") > 0 Тогда
		Возврат Перечисления.onyx_ТипОперации.ПолучениеАгента;
	КонецЕсли;
	
	Если СтрНайти(URL, "/persona") > 0 Тогда
		Возврат Перечисления.onyx_ТипОперации.ПолучениеСпискаАгентов;
	КонецЕсли;
	
	Если СтрНайти(URL, "/chat/create-chat-session") > 0 Тогда
		Возврат Перечисления.onyx_ТипОперации.СозданиеСессии;
	КонецЕсли;
	
	Если СтрНайти(URL, "/chat/send-message") > 0 Тогда
		Возврат Перечисления.onyx_ТипОперации.ОтправкаСообщения;
	КонецЕсли;
	
	Если СтрНайти(URL, "/chat/get-chat-session") > 0 Тогда
		Возврат Перечисления.onyx_ТипОперации.ПолучениеСессии;
	КонецЕсли;
	
	Возврат Перечисления.onyx_ТипОперации.ПолучениеТокена;
	
КонецФункции


Функция ПолучитьОписаниеОшибки(Ответ)
	
	Сообщение = НСтр("ru='HTTP '") + Строка(Ответ.СтатусКод);
	
	Если ЗначениеЗаполнено(Ответ.Данные) Тогда
		ТипДанных = ТипЗнч(Ответ.Данные);
		Если ТипДанных = Тип("Структура") ИЛИ ТипДанных = Тип("Соответствие") Тогда
			Сообщение = ДобавитьДанныеСтруктуры(Сообщение, Ответ.Данные);
		ИначеЕсли ТипДанных = Тип("Массив") Тогда
			Сообщение = ДобавитьДанныеМассива(Сообщение, Ответ.Данные);
		Иначе
			Сообщение = ДобавитьДанныеЗначения(Сообщение, Ответ.Данные);
		КонецЕсли;
	Иначе
		Если Не ПустаяСтрока(Ответ.ТекстОтвета) Тогда
			Сообщение = Сообщение + Символы.ПС + Ответ.ТекстОтвета;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

// Добавляет части сообщения на основании структуры ответа.
//
// Параметры:
//   ИсходноеСообщение - Строка - текст, к которому добавляются детали.
//   ДанныеОшибки - Структура - структура с полями error/message/details.
//
// Возвращаемое значение:
//   Строка - дополненное сообщение.
Функция ДобавитьДанныеСтруктуры(ИсходноеСообщение, ДанныеОшибки)
	
	ИтоговоеСообщение = ИсходноеСообщение;
	
	Если ДанныеОшибки.Свойство("error") Тогда
		ИтоговоеСообщение = ИтоговоеСообщение + ": " + Строка(ДанныеОшибки.error);
	КонецЕсли;
	
	Если ДанныеОшибки.Свойство("message") Тогда
		ИтоговоеСообщение = ИтоговоеСообщение + Символы.ПС + Строка(ДанныеОшибки.message);
	КонецЕсли;
	
	Если ДанныеОшибки.Свойство("details") Тогда
		ИтоговоеСообщение = ИтоговоеСообщение + Символы.ПС + Строка(ДанныеОшибки.details);
	КонецЕсли;
	
	Возврат ИтоговоеСообщение;
	
КонецФункции

// Добавляет части сообщения на основании массива ответа.
//
// Параметры:
//   ИсходноеСообщение - Строка - текст, к которому добавляются элементы.
//   ДанныеОшибки - Массив - массив строк с описаниями ошибок.
//
// Возвращаемое значение:
//   Строка - дополненное сообщение.
Функция ДобавитьДанныеМассива(ИсходноеСообщение, ДанныеОшибки)
	
	Возврат ИсходноеСообщение + Символы.ПС + СтрСоединить(ДанныеОшибки, Символы.ПС);
	
КонецФункции

// Добавляет части сообщения на основании произвольного значения.
//
// Параметры:
//   ИсходноеСообщение - Строка - текст, к которому добавляется значение.
//   ДанныеОшибки - Произвольный - данные ответа.
//
// Возвращаемое значение:
//   Строка - дополненное сообщение.
Функция ДобавитьДанныеЗначения(ИсходноеСообщение, ДанныеОшибки)
	
	Возврат ИсходноеСообщение + Символы.ПС + Строка(ДанныеОшибки);
	
КонецФункции

// Дополняет сообщение об ошибке текстом в зависимости от HTTP-статуса.
//
// Параметры:
//   СтатусКод - Число - код статуса HTTP.
//   БазовоеСообщение - Строка - описание, сформированное API.
//
// Возвращаемое значение:
//   Строка - итоговое сообщение для пользователя.
Функция ДополнитьСообщениеПоСтатусу(СтатусКод, БазовоеСообщение)
	
	Если СтатусКод = HttpCodeUnauthorized() Тогда
		Текст = НСтр("ru='Ошибка авторизации при обращении к API Onyx. Проверьте корректность API ключа и прав доступа.'");
		Возврат Текст + Символы.ПС + БазовоеСообщение;
	ИначеЕсли СтатусКод = HttpCodeForbidden() Тогда
		Текст = НСтр("ru='Доступ к ресурсу Onyx запрещен. Обратитесь к администратору API.'");
		Возврат Текст + Символы.ПС + БазовоеСообщение;
	ИначеЕсли СтатусКод = HttpCodeTooManyRequests() Тогда
		Текст = НСтр("ru='Превышен лимит запросов к API Onyx. Повторите попытку позже.'");
		Возврат Текст + Символы.ПС + БазовоеСообщение;
	Иначе
		Возврат БазовоеСообщение;
	КонецЕсли;
	
КонецФункции

Функция HttpCodeUnauthorized()
	
	Возврат 401;
	
КонецФункции

Функция HttpCodeForbidden()
	
	Возврат 403;
	
КонецФункции

Функция HttpCodeTooManyRequests()
	
	Возврат 429;
	
КонецФункции

Функция HttpErrorCodeMin()
	
	Возврат 400;
	
КонецФункции


#КонецОбласти
